In [2]:
import pandas as pd
import numpy as np

In [3]:
# 갯수 세기
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [4]:
s.count()

9

In [5]:
np.random.seed(1)
df = pd.DataFrame(np.random.randint(5, size=(4,4)))
df.iloc[2,3] = np.nan
df

   0  1  2    3
0  3  4  0  1.0
1  3  0  0  1.0
2  4  4  1  NaN
3  4  2  4  3.0

In [7]:
df.count() #row당 column의 갯수 0 : 0번째 row 에 해당하는 갯수 1 : 1st row에 해당하는 갯수 ////

0    4
1    4
2    4
3    3
dtype: int64

In [9]:
# 카테고리 값 세기 : 시리즈의 값이 정수, 문자열, 카테고리 값인 경우에는 value_counts 메서드로 각각의 값이 나온 횟수를 셀 수 있다.
np.random.seed(1)
s=pd.Series(np.random.randint(6,size=100))
s.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int32

In [10]:
s.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [11]:
# 행/열 합계
np.random.seed(1)
df=pd.DataFrame(np.random.randint(10, size=(4,8)))
df

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [13]:
# 행 합계(가로 합계)
df.sum(axis=1)

0    35
1    34
2    41
3    42
dtype: int64

In [14]:
# 엻 합계
df.sum()

0    24
1    33
2    25
3    24
4    15
5    10
6     5
7    16
dtype: int64

In [15]:
df.loc["Total", :]=df.sum()
df

          0     1     2     3     4     5    6     7
0       5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0
1       6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0
2       4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0
3       9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0
Total  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0

In [18]:
#apply 변환
df = pd.DataFrame({
    'A' : [1,3,4,3,4],
    'B' : [2,3,1,2,3],
    'C' : [1,5,2,4,4]
})
df

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [20]:
df.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [21]:
df.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [22]:
df.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [23]:
df.apply(pd.value_counts).fillna(0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [24]:
# 실수 값을 카테고리 값으로 변환
# cut : 실수 값의 경계선 지정
# qcut : 갯수가 똑같은 구간으로 나누는 경우

In [25]:
ages = [0,2,10,21,23,37,31,61,20,41,32]

In [26]:
bins = [1,15,25,35,60,190]
labels = ["미성년자","청년","중년","장년","노년"]
cats = pd.cut(ages,bins,labels=labels)
cats # categorical 클래스 객체 -> categories 속성에 라벨 문자열을 codes 속성에 정수로 인코딩한 카테고리 값을 가짐

[NaN, 미성년자, 미성년자, 청년, 청년, ..., 중년, 노년, 청년, 장년, 중년]
Length: 11
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]

In [27]:
type(cats)

pandas.core.categorical.Categorical

In [28]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [29]:
cats.codes

array([-1,  0,  0,  1,  1,  3,  2,  4,  1,  3,  2], dtype=int8)

In [30]:
df=pd.DataFrame(ages, columns=["ages"])
df["age_cat"] = pd.cut(df.ages, bins, labels=labels)
df

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      장년
6     31      중년
7     61      노년
8     20      청년
9     41      장년
10    32      중년

In [31]:
# qcut 명령은 같은 데이터를 가진 구간으로 나눈다. 예를 들어 다음 코드는 1000개의 데이터를 4개의 구간으로 나누는데 각 구간은 250개씩의 데이터를 가진다.
data=np.random.randn(1000)
cats=pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

[Q2, Q1, Q2, Q3, Q1, ..., Q1, Q1, Q4, Q4, Q2]
Length: 1000
Categories (4, object): [Q1 < Q2 < Q3 < Q4]

In [32]:
pd.value_counts(cats)

Q4    250
Q3    250
Q2    250
Q1    250
dtype: int64